Merge remote-tracking branch 'origin/sqllite' into sqllite
# Conflicts:
#	diagram.md
